{
  "Parenthood-68": [
    {
      "op_claim": "We live in a society that values having children too much and anyone who prefers having children over adoption is selfish. CMV",
      "op_premise": "My perception of the latter statement developed from a conversation I had with my girlfriend. When we were talking about children, I expressed having an interest in adopting a child. Immediately, she was taken aback and spit out, \"Absolutely not,\" outlining how she would never love the child as much as a kid that she birthed herself and not wanting to have a child that aesthetically did not mix with the rest of her family.', 'Why are we still valuing having children in this society? And for that matter, why do we ostracize people for not wanting to have children, perceiving them as deviant and developmentally stagnant?', 'There are 7.1 billion people on the planet all struggling for food and trying to live day to day life. 153 million children worldwide have lost one or both parents and many more have been born and given up. How do these children not compare to the one with your own fucked up genetics?', \"I was raised with the impression that I should always have kids and I went through college looking for someone to have kids with and would always talk about how I want kids. But it dawned on me how I was always talking about having my own kids with my DNA. Isn't that selfish that I would assume that children need my DNA?\", 'I don\\'t have any sympathy for religious values here (and this could be a different CMV) but wanting to continue to make this world worse and worse (by depleting resources faster) just to have your own children because \"God\" told you to so that you could join him in a supposed afterlife seems self-centered.', \"TL;DR There's a lot of orphaned children or children in shitty homes, why do we need any more of your genes floating around? What makes you so special?",
      "reply-info": [
        {
          "replyer_name": "waldrop02",
          "reply_time": "6 years ago",
          "reply_delta_num": "93",
          "reply_votes": "2 points",
          "reply_contents": [
            {
              "content": "I disagree with your assertion that wanting to have my own child rather than adopt someone else's is a selfish choice on my part",
              "is_claim": "1",
              "claim_type": "disagreement",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": "0",
              "eloquence": "0"
            },
            {
              "content": "I say it was selfish of the biological parent of this child to not care for it or, if they knew they could or would not, either use contraception or terminate the pregnancy before birth",
              "is_claim": "1",
              "claim_type": "evaluation",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": "0",
              "eloquence": "0"
            },
            {
              "content": "It's not selfish of my to not want to care for the child you chose not to care for",
              "is_claim": "1",
              "claim_type": "evaluation",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": "0",
              "eloquence": "0"
            }
          ]
        }
      ]
    }
  ]
}