{"Eugenics-28": [{"op_claim": "I believe that eugenics is a positive thing (provided that it's heavily monitored) CMV", "op_premise": "['There is a litany of genetic conditions and diseases that dramatically alter the quality of life of a person and their families. These people are a drain on the healthcare system, and tie up valuable resources that could be better allocated elsewhere.', \"I am one of these people that tied up the resources. I was born with transposition of the great arteries, and while my quality of life has generally been fair, I also consider the heartbreak this has caused my parents and myself. While it's not been fully determined if it's a genetic condition or simply a mutation that occurs in-utero, if given the choice, I wouldn't wish this upon anyone else.\", \"Science has made remarkable strides in breaking down the genetic code of humans and the maladies the effect us. They can tell us if we carry certain genetic markers for breast cancer (Angelina Jolie recently had a double mastectomy because she tested positive for it), Alzheimer's, and many more.\", \"I don't believe that eugenics should be employed for desirable traits like skin/eye/hair colour, height, etc. But I do believe that if we can prevent the suffering of millions of people, that eugenics is a positive thing, and should be seriously considered as a viable public healthcare initiative.\", 'For the record: I live in Canada (if it matters)', \"Edit 1: If eugenics were to be employed, it would be highly regulated, and only specific genetic markers would be sought. Determining if someone was a risk taker, or had a likelihood of an illness that is manageable and doesn't effect the overall quality of life would not be checked unless specifically requested by the parent. The parents would be able to request a specific genetic marker, or they could test for a list of things from cancers to Alzheimer's.\", \"Additionally, the testing of these embryos would NOT be government mandated, but would be an option that parents can turn to if they fear that their baby would carry a certain gene. I would argue that this should be paid for by your insurance. No one would have access to the records (other than the parents), so insurance companies can't refuse to cover you because you carry a certain gene.\", \"Edit 2: The government cannot force you to have genetic testing, but they should pay for it if you wish to have it done. They can't compel you to destroy embryos or have an abortion if the embryo/fetus tests positive for something. No one but the parents would know the results.\", \"Edit 3: I started to change what I was trying to say by making it more PC, but then I realized that I was making addendum's that I really didn't believe in. I do think that every pregnancy/embryo should be screened, but I don't believe that the government can force you to destroy the embryo or have an abortion.\", \"Edit 4: I'm going out, so won't be responding for a bit.\"]", "reply-info": [{"replyer_name": "Aldrake'", "reply_time": "7 years ago'", "reply_delta_num": "29", "reply_votes": "24 points'", "reply_contents": [{"content": "I don't think what you're describing is what most people mean by the term eugenics", "is_claim": "1", "claim_type": "disagreement", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Technically, you probably are describing an extremely mild form of eugenics, but I would go with the term \"genetic screening\" or something", "is_claim": "1", "claim_type": "interpretation", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Eugenics has connotations of forced sterilization, baby licenses, or even outright murder", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "I don't consider most of the eugenics programs endorsed on this sub as positive things", "is_claim": "1", "claim_type": "disagreement", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Yours is mild enough - voluntary and only a means of making a better-informed medical decision that is already available to individuals - that I don't have a problem with it", "is_claim": "1", "claim_type": "disagreement", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "2", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}, {"replyer_name": "Amarkov'", "reply_time": "7 years ago'", "reply_delta_num": "30", "reply_votes": "8 points'", "reply_contents": [{"content": "What precisely do you mean by \"eugenics\"", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Do you think that people ought to be allowed to choose whether to have/keep children based on genes, or do you think that the government should be allowed to compel those choices", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}]}]}