{"Parenthood-70": [{"op_claim": "I don't see what's so rewarding about having children. CMV.", "op_premise": "Don't get me wrong, I like children. But I always want to give them back to their owners after about 30 minutes. They are snotty, whiny, squirmy, ungrateful, and literally full of shit, especially in the early stages. (I include myself in these descriptions).\", \"And even if I did nothing wrong (though, let's face it, every parents fucks up their kid in some way)... I could end up with the child who dies before I do. Unimaginable pain. Who is betrayed, jailed, insane, psychopathic, whatever. This is not to say having children is the wrong choice for other people. But I don't see anything wrong with holding my view.\", \"Having children is an unacceptably low-reward to high-risk gamble in which I would give away my youth, freedom, and finances. Change my view. Preferably by telling me what's worth it about having your own children.", "reply-info": [{"replyer_name": "cahpahkah", "reply_time": "6 years ago", "reply_delta_num": "59", "reply_votes": "5 points", "reply_contents": [{"content": "They are snotty, whiny, squirmy, ungrateful, and literally full of shit, especially in the early stages", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "This is only true of other people's children", "is_claim": "1", "claim_type": "interpretation", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "(And, yes, it is.) Your children are the most fascinating, wonderful, joyous people in the world, and they fill you with a greater sense of love than you ever thought was possible", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "1", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}, {"replyer_name": "moonflower", "reply_time": "6 years ago", "reply_delta_num": "82", "reply_votes": "3 points", "reply_contents": [{"content": "Are you wanting to understand how other people can find it rewarding, or are you wanting to change your view so that you see it as something which you would find rewarding", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}]}]}