{"Pride-83": [{"op_claim": "I believe black history month is unnecessary and should not be officially recognised. CMV", "op_premise": "There is no denying the contributions and sacrifices black people have made to building society in the countries that celebrate BHM. However, black people are (and have been for a while) subject to exactly the same laws as all other nationalities.', \"I'm not saying that their troublesome past should not be taught. I simply believe that elevating a race and celebrating their achievements for a period of time, no matter what they may have went through in the past, is unfair in a society that supposedly perpetuates all races as equal.\", \"I would take my argument further and say that any race specific services (with the exception of those that provide a physiological services - health, beauty etc) should be illegal as they further serve to segregate that race. However, that's a sidenote and the main point of discussion is BHM.\", \"EDIT: I agree all those who suggest that Black History Month teaches us about a culture and history that's otherwise largely overshadowed by an education focused on European and American matters. However, my trifle with this is that it's not a multicultural event - it's sole focus is on black people. Why not expand to other ethnicities?\", \"EDIT 2:I've been introduced to the fact that other months for other ethnicities actually exist. While they seem to be relatively humble in their celebration and focus (especially in the UK), considering this is a social arrangement my opinion is gradually being swayed.", "reply-info": [{"replyer_name": "Personage1", "reply_time": "6 years ago", "reply_delta_num": "29", "reply_votes": "-4 points", "reply_contents": [{"content": "You do realize that the overwhelming majority of all history is white male history right", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Giving one month to remind everyone that white people weren't the only people to have been on this earth really shouldn't offend anyone who understands history and context", "is_claim": "1", "claim_type": "disagreement", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}]}]}