[
  {
    "Dating-16": [
      {
        "op_claim": "I think women have it much easier when it comes to Dating.",
        "op_premise": "[Just seems like girls have a much easier time finding dates becuase there are a million ways for a guy to screw up, plus it always seems that girls are more wanted in social situations (hence the reason for ladies night), guys usually have to man up and ask the girl, but heaven forbid he gets labeled trying too hard. There are things like ladies night where guys go because there are girls, but girls go for the cheaper drinks. If a guy hits on a girl the wrong way its creepy, or its not bold enough depending on the girl. If a guy\\s a virgin he obviously isn\\t normal, but if a girl is then thats fine. I think girls have a much easier time Dating. Please CMV, edit: thank you all for providing intelligent discussion and expanding my view. I would still say that the average single guy (18-30, decently fit, etc) has a harder time finding a date than the average single woman with the same conditions. However, if both are unattractive, the guy will have more options to become attractive than the girl. There is pretty much no argument that it is easier for a girl to get laid under all conditions., some new viewpoints: 1.) girls have more risk involved in Dating, or at least more perceived risk. I am not sure on the actual numbers but girls feel as though every first date could go very wrong, versus guys maybe feel that every first date could just be boring at worst. It should be noted that men can get drugged and or raped just as women., 2.) Guys attractiveness spectrum is somewhat more balanced: if a guy is hot he will not have as much of an advantage as a hot girl, but if a guy is ugly he has more of a chance to make up for himself. Similar issues with age. That being said, more a higher percentage of women fall into the attractive side than men., 3.) Girls have and easier time getting laid, but much harder time finding a real relationship. A argument came that there is no possible way for men/women to have a harder/easier time finding significant dates if you exclude homosexual relationships, since if you compare the numbers it will by definition be equal. Some debate is still over what is harder: sorting through a number of guys or trying to convince her you are worth it., 4.) guys have more control since they are more able to ask a girl versus having social pressure to not ask a guy. Again, this may be true but I am not sure that having more control is any easier. A pilot has more control over the plane than the passengers., What has seemingly not been brought up: is it harder for a girl to know she is attractive enough? on some levels, i can see the argument - how would a girl know if her boobs are big enough (or face pretty enough or etc) to grab attention of the guys?]",
        "reply-info": [
          {
            "replyer_name": "GnosticGnome",
            "reply_time": "6 years ago",
            "reply_delta_num": "393",
            "reply_votes": "17 points",
            "reply_contents": [
              {
                "content": "guys usually have to man up and ask the girl, but heaven forbid he gets labeled trying too hard",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "But if a guy tries to hard, he\\s blown his chance with that girl",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "He doesnt get made fun of the next day",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " If a girl is the one who asks out the guy, she risks being called forward or a slut",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "However hard it is to risk rejection, it is also hard to wait and hope that someone will ask you out",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "If the issue is meeting people at bars, this is no problem, but many men/women dont want their Dating life to center around bars",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "And if a woman wants a specific guy or type of guy, its much harder for her to signal this to him than it is for him to signal to her",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "A man can ask out all the blondes and ignore all the brunettes",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " A woman has a harder time figuring how to get blonde guys to ask her out without annoying all the brunettes",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "Personage1",
            "reply_time": "6 years ago",
            "reply_delta_num": "29",
            "reply_votes": "5 points",
            "reply_contents": [
              {
                "content": "First of allMy only question is what kind of Dating",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Do you mean that guys are more likely to be desperate for sex at bars than women and so women will have an easier time going home with someone for mindless sex",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Sure, do you mean there are far more quality men out there than women and so women have an easy time getting a man worth their time Sure",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " I would say its the opposite but Im cynical about that",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  },
  {"Dating-17": [
    {"op_claim": "I believe Dating is unequal and heavily favors women. CMV", 
      "op_premise": "[I was previously ignorant of gender inequalities and relations and after reading a ton of r/askwomen, r/askmen, r/Datingadvice, and r/relationships in the past couple months I fear I have grown to hate women, or at least their modern behavior and social roles., I dont want to feel this way because I cant just hate 3.5 billion people but when it comes to the Dating world I feel quite jaded by the endeavour., So, if, for example, I meet a women and wish to pursue a relationship with her, I have to make the first move. Then, should the women choose to accept me, I have to offer a date place and time. Then, in most situations, I have to pay because it was my idea and it would be rude to ask someone to pay for something I invited them to. The money isnt that big of a deal though and feminists usually offer to go dutch so thats nice., After that, Im expected to call and say it was fun, and then plan the next date. During the dates I often feel like I have to carry the conversation because a lot of women are shy so I have to ask questions about their lives while strategically inserting information regarding myself every once in a while so the conversation doesnt feel so one-sided., After that, if we want to move to sex, I have to initiate. Then the performance begins. I have gently kiss her, move my lips down to her neck, giving attention to all parts of her body, caressing her, massaging her, and providing ample foreplay. Then, after enough aussies, she is thoroughly relaxed and penetration can begin. Thus begins a half an hour of tiring cycling of positions of thrusting while she just sits there and maybe moans every now and again. I barely even enjoy myself and she has multiple orgasms., I dont understand how so many women can say theyll break up with a partner if they dont go down on them. Women expect men to do all the work in the bed (overwhelmingly they prefer a dominant partner) yet when it also benefits them for their man to be temporarily submissive by performing cunninglingus it is required. Instead of saying you want a dominant partner why not just say you want one that does all the work? If a women is submissive and a man dominant in a relationship, I think its completely equal if the man recieves oral and the woman doesnt. Obviously if the man likes giving oral thats his prerogative but I reject reddits consensus that a man not reciprocating oral with oral is somehow unfair, like all other acts in and out of the bedroom mean nothing., Another thing that bothers me is when women say they just wanted to be treated like a person, or how we treat other guys. No you dont. I have tried this and it does not work. Men are vulgar to each other and fight. My friends and I constantly talk shit on each other and jokingly reinforce every stereotype when were doing a commentary on shows were watching, for example., Men have to constantly censor themselves and their behavior when trying to get with a women. That\\s why you feel like you are objectified, because you are. I, and most men, cannot act like I do around my friends as I do you because you would be repulsed. You know how when women have a problem they want empathy, reassurance, compassion, and the such from their boyfriend? I\\m listening to you and your problems and just cycling through I\\m sorry to hear that, I can\\t imagine how hard that must be for you, and Let me know if I could do anything to help. If a guy friend came to me with a problem I treat him like a person and we try to collaborate to fix it. If you want to be egalitarian you need to be it on all fronts, and not only on ones that benefit women., Men in general do not feel desired by women. Men buy the gifts, make the dates, and put themselves out there while the women, from her pedestal, wish men would stop putting her on pedestals. We have to constantly reassure you that youre beautiful, not fat, not crazy, etc. while all of mens emotions are completely ignored for that of the womens. Women get annoyed by physical compliments while most men have never even been complimented or can at least count on one hand the amount of times. Even in a relationship it often feels like youre not even physically attracted to us but just likes what we can do for you., Anyways, by now you must think Im some old MRA, bitter, and alone. Im actually 20 and have pretty much kept all of this in my head and never let in manifest in any way. I try to be a good person and have had great and fulfilling relationships. Dont think Im also not aware of the problems women face and how they are discriminated against. Im aware many can only get off through clitoral stimulation, that they are only viewed as sexual creatures and seldom seen for their intelligence, and preyed against sexually, in the workplace, and society. I feel such cognitive dissonance because gender relations are so complicated and changing every day and there is so much inequality and discrimination on both sides that Im aware of that its hard to just shut off and recognize most people try to be good. I just really hate how disproportioned it seems to be in the Dating world., TL;DR: Dating and relationships favor women.]", "reply-info": [{"replyer_name": "Imwe", "reply_time": "7 years ago", "reply_delta_num": "14", "reply_votes": "6 points", "reply_contents": [{"content": "What youve written in your post seems to be a combination of several things thatve come straight from a MRA handbook, some that is just regular human interaction, and some that you choose to do to yourself", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Lets start by saying that the type of Dating youre describing is very localized to your culture", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " It makes no sense to dislike all women if some women you know did something wrong (which they havent just to be clear)", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Let me ask you something: if it is so much trouble to get dates, maintain a relationship, and not be yourself, why are you still chasing these goals", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " It doesnt seem to make you very happy so maybe you should just give up", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " If you dont want to give up it means you are getting something from these relationships that your friends are unable to give", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " What exactly do you get from your partners", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " The way you wrote this post it comes across as if your partners are extremely selfish and live very easy lives just because they are women", 
        "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " That is what is making you sound bitter and like a MRA", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Have you ever looked at this from the perspective of women", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " What do they do if they see someone they like", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Exactly the same you do, they try to make contact, make a date, and try to start a relationship or a one-night-stand", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " The relations between the sexes are a lot more equal than you think", "is_claim": "1", "claim_type": "disagreement", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " So this:Men in general do not feel desired by women", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Is more an indication of the type of relationships youve had than a general feeling of men", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Have you ever talked about this with your partners", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " That you want to be desired and how they can achieve that", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " This:Another thing that bothers me is when women say they just wanted to be treated like a person, or how we treat other guys", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", 
        "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "doesnt sound like youve talked to the women whove said this", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Being treated like a person isnt asking for much", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " It maybe is the way you treat your friends but is that the benchmark that should be used", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " She doesnt want to be just one of your friends, she wants to be your partner", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " That alone means you have to treat her differently from your friends", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " You should treat her like your equal", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " If you want to receive oral sex you should be prepared to give the same to her", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " That is what equality is about", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}, {"replyer_name": "DrDerpberg", "reply_time": "7 years ago", "reply_delta_num": "42", "reply_votes": "0 points", "reply_contents": [{"content": "You dont have to play this game", "is_claim": "1", "claim_type": "Disagreement", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "I made my girlfriend (of nearly 5 years) pay for the first part of our second date on a flimsy pretext (a joke bet established on our first date)", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "1", "concreteness": "0", "eloquence": "0"}, {"content": " She paid without whining or being put off, and I was satisfied she wasnt a typical passive wallflower and paid for the rest of the evening", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "1", "concreteness": "0", "eloquence": "0"}, {"content": "You dont have to play any game you dont want to", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "1", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Paying is kind of hard to get out of because its sort of a dick move if someone thinks youre paying but you dont, but if youre with a woman who makes zero effort to pay after a few dates you can easily stop seeing her on those grounds", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Similarly you dont have to come up with 100% of the fun ideas for dates", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "1", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "If shes too lame to have any ideas for dates or even conversation, expects to be pampered every step of the way, takes no initiative, and doesnt contribute to the early Dating phase in any other way, why do you think you might want a relationship with her", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " By framing dates as YOU impressing HER, you are taking 100% of the burden upon yourself and you wont even have a chance to see if you like her back", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "So yes, you will reject a fair number of women based on these new criteria, and some will be offended that you actually treated them like an adult", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " You dont want those women anyway and you shouldnt waste your time with them", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "1", "evidence": "1", "relevance": "1", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}, {"replyer_name": "growflet", "reply_time": "7 years ago", "reply_delta_num": "64", "reply_votes": "96 points", "reply_contents": [{"content": "There is a lot to address here, but Ill just take on one point", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "This about this a moment:You are using reddit forums as your reference points for how Dating happens and works", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Reddit is heavily male centric - 72% male", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "1", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "The MRA subreddit is 3 times the size of the feminism subreddit", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "The PUA subreddit is over 5 times the size of the feminism subreddit", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "The lesbian subreddit is for (male gaze oriented) porn relegating the actual lesbians to a different forum", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "I could go on", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Do you really think this is a good place to learn about what women are like and how to interact with them", "is_claim": "1", "claim_type": "Interpretation", "logos": "0", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}]}]
  },
  {
    "Dating-19": 
      [{"op_claim": "I consider online Dating and Dating websites to be for quitters and people are taking the easy way out. CMV", "op_premise": "[I consider online Dating and Dating website to be for quitters in a sense that they are too lazy or scared to meet people in public. I feel like if I ever met someone through these sites I would feel that I took the easy way out. Is there anyone who has signed up to one of these websites and not felt like they gave up? Do I have a legit view or are my views just too old school?, Please Change my view because I would like to see these sites as real opportunities but I cant get over this negative stigma I have for them.]", "reply-info": [{"replyer_name": "Grunt08", "reply_time": "6 years ago", "reply_delta_num": "206", "reply_votes": "20 points", "reply_contents": [{"content": "Going to a bar: maybe somebody I meet there is looking for the same thing I am, maybe they arent", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " If they are, maybe therell be mutual attraction, maybe there wont", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " If there is, maybe well hit it off, maybe we wont", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " If we do, maybe were compatible in the long term, maybe we arent", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " If we are", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "maybe I find out shes a closet Scientologist or an Al-Qaeda sleeper agent", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Internet Dating: write some stuff about me and put it on a profile", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Magic computer weeds out people who arent looking for someone like me or who I wouldnt be looking for", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " I can weed out people who seem incompatible or unattractive", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " I can specifically say no Scientologists or Al-Qaeda", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "The first process can take a whole night and fail at the first step", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " I can accomplish the whole internet thing in an hour", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "1", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " I may also find the mythical hot, xbox-loving, good-cooking, bisexual nymphomaniac Id probably never even meet without the internet", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "0", "relevance": "1", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "TLDR-Work smarter, not harder", "is_claim": "1", "claim_type": "interperetation", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}, {"replyer_name": "kairisika", "reply_time": "6 years ago", "reply_delta_num": "12", "reply_votes": "1 point", "reply_contents": [{"content": "Dating online isnt quitting - its getting serious", "is_claim": "1", "claim_type": "disagreement", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " When you go out meeting people in person, you meet all kinds of people", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " People looking for friends, people looking for relationships, people looking for fuck-buddies, people just looking to go out with their own buddies, etc", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "If you just like meeting people in general, its a good way to do it", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "1", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "If you know that you would like to meet someone for the purposes of forming a romantic relationship, then there is value in going to a place where everyone else is also specifically looking for a romantic relationship", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "1", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Online Dating is for people who know what they want, and are interested in actively seeking it", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Now, if you stay online, then yes, youre not actually getting anywhere", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "1", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " But if you just use it as a way to find other people interested in what youre interested in, and then make plans to meet the people you contact in person for the actual Dating process, youre just doing a more efficient starter search", "is_claim": "0", "claim_type": "0", "logos": "0", "pathos": "1", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}, {"replyer_name": "McKoijion", "reply_time": "6 years ago", "reply_delta_num": "490", "reply_votes": "1 point", "reply_contents": [{"content": "For most of human history, people would get married to people that were chosen by their parents", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Parents would analyze social standing, compatibility, sometimes even attractiveness in making their decision for you", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Then that fell out of vogue, and suddenly people needed to do all that leg work on their own", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Instead of choosing from a small pool of mates, that was tailored by their parents, people had to go out and talk to hundreds of people on their own", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " This dramatically increased the amount of work it took to meet people", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Even then, people relied on friends and acquaintances to make recommendations to them", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Now we have computers to whittle down potential mates", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " We can search based on any number of traits, and we can meet the people most likely to make us happy", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": "Dating, in its most conservative sense, has only existed for about 300 years at most", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Its still taboo for billions of people alive today", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " Online Dating has only been around for about 30 years", "is_claim": "0", "claim_type": "0", "logos": "1", "pathos": "0", "evidence": "1", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}, {"content": " With time, it will become less stigmatized and more popular, just as regular Dating did in the past 100 years", "is_claim": "1", "claim_type": "interpretation", "logos": "0", "pathos": "0", "evidence": "0", "relevance": "0", "ethos": "0", "concreteness": "0", "eloquence": "0"}]}]}]
  },
  {
    "Dating-20": [
      {
        "op_claim": "I Firmly Believe Online Dating is like Giving Up in the Real World and the Only Women on There are Either Conventionally Unattractive or, if They Are Attractive, Have Some Sort of Personality Flaw. CMV.",
        "op_premise": "[I once had a conversation with a friend that went something like:, Me: She\\s pretty hot, but I don\\t think she has a fuck buddy right now., Him: No, fuck that. A girl that hot can\\t not be fucking someone regularly, For some reason, this conversation has stuck with me. I only ever had one girlfriend for 8 months during my freshman year of college. Now, as a senior in college, I had only had a couple drunk hookups since then., My parents awkwardly said to me one day, You know, fourth_alternate, we realized you hadn\\t dated anyone since freshman year. I highly recommend you give online Dating a try. This frustrated me. Now my parents didn\\t even believe in me to try to start a relationship the real way. I had always equated online Dating with giving up, Now, I thought that people give up for three reasons:, They are too unattractive to have the confidence to try to get a date in the real world, They are too awkward in the real world, They have some sort of crazy personality flaw that one could easily recognize in the real world, but not online., In my mind, there is no reason why a sane, somewhat attractive woman (both physically and psychologically) would not be able to find a date in real life, and would have to resort to online Dating. It makes no fucking sense to me. CMV., EDIT: Wow. All these responses were amazing and well thought-out. I guess the only way to really is to try it myself. For now, consider me. I would award it to a specific person, but everyone who responded had very unique, yet solid points to make. Thanks everyone! I do have some... err... unconventional views about things, but I will always come here in the future if I want someone to C my V!]",
        "reply-info": [
          {
            "replyer_name": "blackflag415",
            "reply_time": "6 years ago",
            "reply_delta_num": "19",
            "reply_votes": "6 points",
            "reply_contents": [
              {
                "content": "I met my gf online, shes amazing",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Weve been Dating for over a year",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " My case is a little different though, I live in a small town in Japan so options for traditional Dating were limited",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "But if you want a regular success story, my brother met a beautiful women online and they dated for 3ish years",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Theyve since broken up but that has nothing to do with how they met",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "As omegatheta said, your stated conversation hints that you dont know a lot about women",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Will you accept some general Dating advice, not related to where to meet",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Don\\t use the word fuck buddy",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Don\\t talk to your parents other than broad generalities",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Make some female friends, purely platonic",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " This will help you to understand how women think/feel/act, plus their advice is invaluable",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Focus on turning yourself into someone that someone would want to date, i.e. exercise, dress well, read a book or two, get some interests (for me it was music, but for you it can be anything)",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Dont wear sweatshirts if you do that you can meet women online and in real life",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "A_Soporific",
            "reply_time": "6 years ago",
            "reply_delta_num": "134",
            "reply_votes": "3 points",
            "reply_contents": [
              {
                "content": "People generally meet partners through family/friends, work, school, church/clubs, and occasionally at bars or other social places of business",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "If someone works at a small place of business without contact with the general public then that one is out altogether",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " If they work long hours, a non-standard shift, or a second job then they dont have time to go out to bars or other social businesses",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " If they are out of school and already tried out those people that their family/friends introduce to them (or dont trust family/friends sufficiently) then those are out as well",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " That leaves Church or social clubs, previous scheduling issues aside, not everyone holds such memberships",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " In this situation how else is someone supposed to meet anyone aside from literally tripping over them",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Even if you are out and about that doesnt mean that you are receptive to romantic propositions",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Thats one big advantage to Dating sites, you know everyone else there is actively looking",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "Dating-21": [
      {
        "op_claim": "I understand and agree with the social stigma associated with online Dating. CMV.",
        "op_premise": "[First off, I realize that this stigma is fading more and more in the last years, and meeting your partner on the internet is more and more becoming both a common occurance, and a socially accepted practice - however, most people still seem to feel somewhat uneasy or embarassed about it, and a conversation about it can easily turn into an awkward situation., Secondly, I have to disclose that I\\m not exactly qualified to have an opinion on this matter at all, being a (mostly kissless) virgin at age 21 who never really dabbled in Dating in general so far - I have, however, been romantically active on the internet in the past, holding some sort-of online relationships that consisted of prolonged and daily instant messaging with a few girls, but that never lead to any real-life interaction and ultimately faded away into mutual silence., But maybe because of my former experience with this topic, I can\\t help but agree with the social consensus about online Dating being weird, unnormal or weak. Resorting to online Dating seems, to me, like a kind-of last resort, something you either do after you\\ve had no success Dating people in reality and are afraid or hesitant to try again, or something you attempt due to social and sexual anxiety, a lack of confidence and unwillingness to put yourself out there and give it a shot for real., Whenever I\\m with a group and someone tells about how they\\ve met their partner online, I smile and nod like everyone else, trying to not be judgemental and keep an open mind, but I can\\t shake some thoughts in the back of my head along the lines of Well, no surprise there! and What a loser. - and looking around the rest of the group, I get the impression that other people are also thinking similar things, and that no one quite knows how to react., I realize these thoughts are quite arrogant and douche-y, especially considering my own lack of experience and my former history. I both feel like I\\m unqualified to judge other people in this way because I have nothing to show for myself, yet also competent because I\\ve been there before and can understand the motivations., But who knows - Im probably just bitter. Id love to become more open-minded in this regard. Please, CMV., TLDR: I\\ve never dated, and only held some online relationships - yet I still think online Dating is for losers. CMV., EDIT: I want to emphasize that I dont mean to offend anyone with the points or choices of words presented here - please, do not think that! I am here because I recognize this mentality as faulty, and would love to hear some arguments that convince me to finally discard it., EDIT2: Changed unnatural to unnormal. Because that sounds so much better.]",
        "reply-info": [
          {
            "replyer_name": "nikoberg",
            "reply_time": "7 years ago",
            "reply_delta_num": "83",
            "reply_votes": "9 points",
            "reply_contents": [
              {
                "content": "Over 60% of gay relationships start online",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " If you have a more specific set of interests, you arent exposed to nearly as many people youre compatible with",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Online Dating is a huge plus, especially if you live in a more rural area",
                "is_claim": "1",
                "claim_type": "evaluation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "Dating-22": [
      {
        "op_claim": "I believe the unwillingness to date other races is not a personal preference, but is racist/prejudice. CMV",
        "op_premise": "[Specifically, I see alot if this in Dating websites when in the description it may say something like whites only or no blacks. I\\ve ever seen on here that many people defend these actions because it isn\\t an act of racism, but an act of personal preference. I believe a preference is something that you would prefer, but not necessarily need. For example, I prefer long hair on girls I date, but I don\\t completely eliminate every short haired girl in my Dating pool. Eliminating every single non-white person without so much giving them a chance to introduce themselves shows blatant racism in my eyes., In addition, I see people defend this by stating they can\\t help what they\\re attracted to, but I still don\\t see that as a real arguement. A better description would be I\\m mostly attracted to my own race, so farewarning, rather than no black people. One statement states you\\re most attracted to your own race, while the other blatantly eliminates an entire group of people without there being a remote close of a chance., I believe there could be many potential deal breakers a person could have, but having one based on ones skin color is racist. Please change my view., Edit- theres a really good discussion here guys. I (now) dont think saying racist was a good way to describe it (that view wasnt really changed due to a single comment, but rather multiple, so I award no deltas so far, mostly because my entire view hasnt changed, but a certain aspect), but I still feel a person has to have prejudice against a race to not even consider Dating them., Edit #2- Many people have made great arguments here and Im sorry I couldnt address all of you; I had no idea there would be so many responses. While my view hasnt been completely changed, it certainly has given me a lot to think about, and ill even go as far to say as its not a racist act, for a good portion of people, at all bit rather a preference. However I still do feel its a bit prejudice to some extent to not give a race a chance. Thanks for letting me see the opposing arguments!]",
        "reply-info": [
          {
            "replyer_name": "sheep74",
            "reply_time": "6 years ago",
            "reply_delta_num": "22",
            "reply_votes": "3 points",
            "reply_contents": [
              {
                "content": "So firstly Id point out that getting this from Dating sites isnt the best way to go about it",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " People do put their preferences on there where, in reality, theyd be more flexible",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " For example you see no-smokers or blondes only when, in the real world, that type of superficiality doesnt really make much of a difference when relationships form",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " People put their ideal partner on there even if theyd actually ignore certain superficial traits in real life (for example women often put exact heights but I doubt if theyve all stuck tape measures up to every man theyve dated)I think some people are racist and thus would put things like whites only but for others its really no different to preferring any look over another",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Rather than focusing on skin tone we can look at dress - there are plenty of people who are not attracted to the goth look at all",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Are they being prejudice in some way or is it just a look they dont like",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I have one rather intriguing example",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " I have a friend who is originally from pakistan, and they do not find people of middle eastern decent attractive in the slightest, they would put whites only on their profile",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Is that racist",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " They dont have a problem with people of that race, they are that race, their family is that race, but they are not attracted to that race",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "hacksoncode",
            "reply_time": "6 years ago",
            "reply_delta_num": "393",
            "reply_votes": "1 point",
            "reply_contents": [
              {
                "content": "I think that the view you have needs one slight modification, which is to say that expressed unwillingness to date other races may be racist",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Youre making the same kind of unjustified generalization that racists make",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "You yourself say that its not racist if the person simply isnt attracted to a particular race, statistically speaking",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " But then races only exist statistically speaking",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Theres no biological basis for the concept at all",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Perhaps they are simply referring to a particular body/skin type that they dont find attractive",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Some people might say they are unwilling to date blacks because they are racist against blacks",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Theres no doubt that is true",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " For example, if they said I don\\t want to date blacks, who would want to date a monkey",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " you could be pretty darn sure that they are a racist in the normative sense",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "However, someone else that says I\\m not interested in Dating blacks could easily be saying exactly what you are saying is ok, i.e. I\\m not physically attracted to the somatic category that society describes as \\black\\",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " This wouldn\\t be racist, this would just be describing a strong physical preference, much the same way that someone might say I\\m not attracted to fat/skinny people",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "IAmAN00bie",
            "reply_time": "6 years ago",
            "reply_delta_num": "19",
            "reply_votes": "1 point",
            "reply_contents": [
              {
                "content": "Its not mutually exclusive",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Someones personal preferences can be prejudiced",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " However, its pointless trying to blame them for it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "You\\re not born loving a certain race or skin tone",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " The physical features youre attracted to are hugely affected by how you grow up, what you see/experience, who you interact with, etc",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "So, how can you hold an individual responsible for that",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " It really isnt their fault, and its not something that they can easily change",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Yes, its racist and/or prejudiced",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " But its pointless to blame individuals for it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "Dating-23": [
      {
        "op_claim": "I do not think its transphobic to refuse to date a trans person. CMV",
        "op_premise": "[None]",
        "reply-info": [
          {
            "replyer_name": "RobertK1",
            "reply_time": "6 years ago",
            "reply_delta_num": "11",
            "reply_votes": "1 point",
            "reply_contents": [
              {
                "content": "If you met an amazing, charming woman who you found beautiful, interesting, intelligent, and engaging, and then found out she was half Mexican and decided not to date her welp",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I mean it\\s basically like I\\d date you, except I found out one piece of information about your personal history that will in no way affect you or me today, and now I won\\t, even though I find you super attractive and otherwise worth Dating yeah, I find it a little bigoted",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Im not saying you dont have a right to your personal preference, because you do (as does the person who wont date anyone with a drop of Mexican blood) but it does come off as prejudiced",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "May I ask why you wouldnt date a trans woman",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "Amarkov",
            "reply_time": "6 years ago",
            "reply_delta_num": "30",
            "reply_votes": "53 points",
            "reply_contents": [
              {
                "content": "But why dont you want to date one",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Its clearly not that you arent attracted to or sexually compatible with trans people; you admit the possibility that you might be sexually involved with a trans person without knowing about it",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "Dating-25": [
      {
        "op_claim": "I dont find black people attractive. I believe that I am not racist. CMV",
        "op_premise": "[I live in a county in the United Kingdom where there simply arent many minorities, and nearly all of the people I meet and interact with are white., I dont find black people attractive, and I have never met a black woman I would date (sorry, Im a bit vain). Not directly because theyre black, but because I dont find them attractive. I find plenty of other minorities attractive, and I have black friends (but lets face it, every closet racist says that)., I dont believe I am racist. Its not a conscious decision to find black people unattractive, I just do. I believe that I am not racist in the same way that a straight person is not sexist to find other members of the same sex unattractive., CMV!, Sorry if any of my terminology was non-PC.]",
        "reply-info": [
          {
            "replyer_name": "veggiesama",
            "reply_time": "6 years ago",
            "reply_delta_num": "42",
            "reply_votes": "2 points",
            "reply_contents": [
              {
                "content": "I get it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " You dont drink it black",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Perhaps you should ease in with a mocha or cappuccino, something dark but with a milky aftertaste",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "If its more of a cultural thing (you dont like the way they typically dress, act, or speak), there are plenty who grew up in mostly white suburban communities and who have adopted those subcultural mannerisms",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " If its a racial thing, like the skin, lips, bone structure, etc",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " I have to remind you that a whole spectrum of different facial and body types exist within the race and between races, and plenty of whites might suffer from the same problems you see as defining black features",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I don\\t think it\\s racist to say Generally, I don\\t find blacks attractive",
                "is_claim": "1",
                "claim_type": "evaluation ",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " However, it\\s moving into unfair prejudice if you say I don\\t find blacks attractive, and I never will",
                "is_claim": "1",
                "claim_type": "evaluation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Whatever the case, I don\\t think either statement is racist because I don\\t think relationship discrimination should be considered a thing, else I could file lawsuits against every high school girl who laughed at my advances",
                "is_claim": "1",
                "claim_type": "evaluation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "swearrengen",
            "reply_time": "6 years ago",
            "reply_delta_num": "135",
            "reply_votes": "17 points",
            "reply_contents": [
              {
                "content": "I believe that I am not a racist",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Do you believe that your identity as an individual, your personality, beliefs, predispositions or behaviour - has been predetermined by your genetic racial group",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "(Whatever that race is - it doesnt particularly matter)",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Do you believe that other peoples identity as individuals, their personalities, beliefs, predispositions or behaviours - has been predetermined by their genetic racial group",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "If yes to either or both questions, then you are a racist",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Liking or not-liking some racial physical attribute has nothing to do with it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Attributing individual identity as predetermined by racial physical attributes is what racism is all about",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Racism is a form of predeterminism, the belief that you are your race",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "Nepene",
            "reply_time": "6 years ago",
            "reply_delta_num": "179",
            "reply_votes": "324 points",
            "reply_contents": [
              {
                "content": "While its not racist to have a preference for a particular race or group, it is slightly racist to say (with little experience) that you dont find any black women attractive because you have a stereotype about all black women",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "A slight shift in your views would make it not racist",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " If you just believed that you had never met a black women you would date and you didnt find any of the black women you knew attractive that would be totally fine",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " You dont meet many black women, it may be that you jut dont meet enough to meet one you find attractive",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Its totally fine to not date women who are black and unattractive",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Its less fine to not date black women",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " You could meet a totally hot and awesome black woman",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "sarcasmandsocialism",
            "reply_time": "6 years ago",
            "reply_delta_num": "21",
            "reply_votes": "24 points",
            "reply_contents": [
              {
                "content": "Its not a conscious decision to find black people unattractive, I just do",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "The vast majority of racism comes from subconscious bias, rather than conscious bigotry",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "How do you define racist",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " There are many different definitions and without having a common definition of the word, we cant really discuss whether you are racist",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "Dating-26": [
      {
        "op_claim": "I am a transgender woman. I think refusing to date a post-op trans woman because they are trans is transphobic. Please CMV",
        "op_premise": "[None]",
        "reply-info": [
          {
            "replyer_name": "hacksoncode",
            "reply_time": "6 years ago",
            "reply_delta_num": "393",
            "reply_votes": "6 points",
            "reply_contents": [
              {
                "content": "This has come up many times before, and led me to a realization that I hadnt had before, so Ill share it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I did a thought experiment about a biological woman that is transsexual",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " And I realized that I wouldnt have a problem Dating this person, as long as they were comfortable enough with their body not to make a big deal out of it or desire surgery",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Odd, isnt it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " And yes, Im aware that its possible that this is entirely impossible, by definition",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Basically, what I realized is that I dont care for people that are (or have been) so uncomfortable with their body that they are willing to have surgery to change it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I dont like boob jobs on women (and yes, even if I couldnt tell before, if I found out later it would be a big turn-off for me)",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " I dont like face lifts",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Reconstructive surgery is different, in that its someone recovering from an injury or medical procedure",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "So I guess what I would say is that you should change your view to some people that wouldn\\t date a trans woman are transphobic",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Thats probably more accurate anyway",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Because I think most people in this situation are actually more homophobic than transphobic per se, and have a belief that surgery cant actually change a persons sex",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "anonoman925",
            "reply_time": "6 years ago",
            "reply_delta_num": "32",
            "reply_votes": "1 point",
            "reply_contents": [
              {
                "content": "Just to come at it a different way: so what",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Would you want to date someone who is trans phobic",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Would you want to hang out with people who are transphobic in general",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I understand you want your view changed on a definition, but in all honesty, so what",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I have a friend making the male- female leap",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " I dont give a fuck what he does with his dick; its his/her liberty",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " He is currently not out to his stable family and friends",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " These people are extremely conservative and his family is conservative Mormon",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Hes going to lose many of them or they will direct their phobia at him",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Theres no denying that",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " But after we label it, whats the next step",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " How do we overcome the phobia",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "In sum, labels are pretty useless",
                "is_claim": "1",
                "claim_type": "evaluation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " It becomes a tool of bifurcation and your efforts would be better directed at less bifurcated efforts",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "stevejavson",
            "reply_time": "6 years ago",
            "reply_delta_num": "12",
            "reply_votes": "5 points",
            "reply_contents": [
              {
                "content": "We still live in a pretty transphobic world, and having a trans parter is likely going to have some unsavory consequences down the road",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " For example, maybe my family and friends are bigoted against trans people and there would be a lot of drama I dont want to get involved with if they ever found out",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "Crayshack",
            "reply_time": "6 years ago",
            "reply_delta_num": "145",
            "reply_votes": "6 points",
            "reply_contents": [
              {
                "content": "What if the primary reason I want a relationship is to have children",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": " Being trans, even post-op, means that you are infertile and therefore not what I would want out of a relationship",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "Thornnuminous",
            "reply_time": "6 years ago",
            "reply_delta_num": "16",
            "reply_votes": "1 point",
            "reply_contents": [
              {
                "content": "If a man wants to have biological children with his wife, he cant date trans women because then he will never be able to have biological children with one if he marries her",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "1",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  }
]