[
  {
    "Pride-83": [
      {
        "op_claim": "I believe black history month is unnecessary and should not be officially recognised. CMV",
        "op_premise": "There is no denying the contributions and sacrifices black people have made to building society in the countries that celebrate BHM. However, black people are (and have been for a while) subject to exactly the same laws as all other nationalities.', \"I'm not saying that their troublesome past should not be taught. I simply believe that elevating a race and celebrating their achievements for a period of time, no matter what they may have went through in the past, is unfair in a society that supposedly perpetuates all races as equal.\", \"I would take my argument further and say that any race specific services (with the exception of those that provide a physiological services - health, beauty etc) should be illegal as they further serve to segregate that race. However, that's a sidenote and the main point of discussion is BHM.\", \"EDIT: I agree all those who suggest that Black History Month teaches us about a culture and history that's otherwise largely overshadowed by an education focused on European and American matters. However, my trifle with this is that it's not a multicultural event - it's sole focus is on black people. Why not expand to other ethnicities?\", \"EDIT 2:I've been introduced to the fact that other months for other ethnicities actually exist. While they seem to be relatively humble in their celebration and focus (especially in the UK), considering this is a social arrangement my opinion is gradually being swayed.",
        "reply-info": [
          {
            "replyer_name": "Personage1",
            "reply_time": "6 years ago",
            "reply_delta_num": "29",
            "reply_votes": "-4 points",
            "reply_contents": [
              {
                "content": "You do realize that the overwhelming majority of all history is white male history right",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Giving one month to remind everyone that white people weren't the only people to have been on this earth really shouldn't offend anyone who understands history and context",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "Pride-89": [
      {
        "op_claim": "I think the Pride Parade enforces stereotypes and is a hindrance on the Gay Rights movement. CMV",
        "op_premise": "I support gay marriage as much as the next Liberal Canadian, but I think that the Gay Pride Parade does more damage to the LGBTQ community than the community would like.', \"I think of it this way - people who don't accept homosexuals often believe that gay people are all overly eccentric individuals who prance around acting fabulous. There is a large group of men, often walking around wearing little to no clothing - often times intoxicated - and the event is highly publicized around the world.\", 'If someone was on the fence about supporting the gay community, would attending a pride parade really make them want to support the community? Everything people falsely believe about the gay community is seemingly proven true when people hear about the pride parade.', \"I understand the whole 'love who you are and we accept you' movement that the pride parade is promoting, but Jesus Christ people. I'm not against old men wearing thongs in public because they are gay, I'm against it because I just don't want to see it. As a heterosexual man, I get equally uncomfortable when an attractive woman walks around in a very revealing outfit in public.\", 'Please, change my view, and convince me that the pride parade does more good than it does harm.', \"Edit: I think a lot of you are assuming that I'm NOT against women wearing skimpy outfits for other parades. And again, I get equally as uncomfortable. It's just not something that should be shown in a public place in my opinion.\", \"I'm seeing a lot of pro-gay comments and that's fantastic, but please don't forget that I am also for the gay movement. I just think that the pride parade is inhibitating the social movement for worldwide legalization and acceptance.\", \"This is one of those topics that no matter how I word this i am going to seem like an asshole. So i'll just say : why would I want to watch a bunch of mostly naked men and women wander the streets dancing? I'm all for people embracing their sexuality, but I think that your sexuality should be something you keep close to you, whether you are gay or straight. I'm genuinely opposed to men oggling women to express their sexuality as well, so don't think it's just me being against gay expression.\", 'EDIT 2***: Alright alright you win THIS time Reddit. From some what I\\'ve read, the pride parade is accepting in the way that a lot of people can say \"If that hairy naked dude is comfortable with who he is, then I can be too!\" Which  although it sounds a bit ridiculous, I can see how it can have a positive impact in the community. Everyone can be accepted for who they are, and if I ever see someone being overly fabulous, I think in my head I\\'m just going to assume that this is a one-off thing that they do in order to make other members of the community comfortable in their own skin.', 'THAT BEING SAID - it still enforces ridiculous stereotypes that I loathe...but the positive impact of the parade seems to outweigh the negativity the community gets from the stereotypes.', \"TLDR; You have all, slowly convinced me that the Pride Parade can be a positive thing in people's lives because people can think 'If he's comfortable - then I can be too.' But you haven't convinced me that the pride parade DOESN'T push RIDICULOUS stereotypes into the average person's mind.\", \"Also, TIL a lot of people supporting the gay movement are really hateful towards people that don't support every aspect of the gay community.\", \"Oh. And I'm digging all the discussion in the comments. Even though a lot of it is one sided.",
        "reply-info": [
          {
            "replyer_name": "BenIncognito",
            "reply_time": "6 years ago",
            "reply_delta_num": "135",
            "reply_votes": "23 points",
            "reply_contents": [
              {
                "content": "If someone was on the fence about supporting the gay community, would attending a pride parade really make them want to support the community",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Everything people falsely believe about the gay community is seemingly proven true when people hear about the pride parade",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "People who would only support homosexuals if they acted \"normal\" (like heterosexuals in their opinion) are jerks and, quite frankly, I don't care about them",
                "is_claim": "1",
                "claim_type": "evaluation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Allies should be allies regardless of their perception of the gay community, because human rights transcend any issue one might have with harmless behavior",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "veggiesama",
            "reply_time": "6 years ago",
            "reply_delta_num": "42",
            "reply_votes": "7 points",
            "reply_contents": [
              {
                "content": "overly eccentric individuals who prance around",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "There is a large group of men, often walking around wearing little to no clothing - often times intoxicated - and the event is highly publicized around the world",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Except for the part about being \"fabulous,\" I'd say this describes a lot of the more outrageous sports fans",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Plenty eccentric, plenty drunk, plenty publicized",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Does not affect the popular perception of sports whatsoever",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "Pride-90": [
      {
        "op_claim": "I believe gay pride parades are a gross and inappropriate festivity that damages the LGBT community. CMV",
        "op_premise": "I support LGBT rights. I want my children to support the LGBT community too, but I can't take them to a gay pride parade. There is a lot of inappropriate imagery and goings on that I don't want my children exposed to.\", 'The parades also reinforce the stereotype that homosexuals are out-of-control nymphomaniacs. This fear fuels the conservative agenda:', '\"If you want to see what the gay community is all about, go watch their pride parade. Do you want your children to accept that as a normal predisposition in life?\"', 'I feel like the gay community should have a positive outreach celebration to show everyone how \"normal\" the average gay person is.', \"I've heard the argument that the pride parades exist for homosexuals to just be themselves, but I don't agree with it. To me, that's like having a heterosexual pride festival full of explicit sexual themes.",
        "reply-info": [
          {
            "replyer_name": "TryUsingScience",
            "reply_time": "7 years ago",
            "reply_delta_num": "10",
            "reply_votes": "10 points",
            "reply_contents": [
              {
                "content": "To me, that's like having a heterosexual pride festival full of explicit sexual themes",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "You mean like Mardi Gras",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Or Halloween",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "364 days of the year, gay people work in offices and keep to ourselves and generally are normal everyday people",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Plenty of us are still in the closet",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "You don't think we should get one day to be as flamboyant as we so desire",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "And there is a part that I am sorry, but you will never understand as a heterosexual",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I remember going to my very first Pride in San Francisco",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I watched the parade, and walked around looking at rainbows, and for the very first time in my life, felt like it was okay to be who I was",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "For just one day, in this one place, if I hit on a woman, I knew she wouldn't be offended",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "She might not be interested - she might even be straight - but she wouldn't be offended",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I could go up to a cute stranger and strike up a conversation and not have to search for subtle hints before I could even start flirting, because even if my attention wasn't reciprocated, it wouldn't be met with disgust or physical violence",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I didn't realize until that moment how wrong it was the rest of the time that I didn't feel that way",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "1",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "I can't flirt with the cute cashier or the stranger on the bus",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Not without doing the mental math on how likely they are to freak out at me",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "But during Pride",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "During Pride, it's finally okay",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "It's one day",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Turn off the TV and stay inside and play board games if you're so worried that your children seeing a few naked guys and a lot of silly costumes is going to scar them forever",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "RobertK1",
            "reply_time": "7 years ago",
            "reply_delta_num": "11",
            "reply_votes": "4 points",
            "reply_contents": [
              {
                "content": "I feel like the gay community should have a positive outreach celebration to show everyone how \"normal\" the average gay person is",
                "is_claim": "1",
                "claim_type": "evaluation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "That's the entire point",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "The entire point of the festival is to celebrate that people who are not average, boring, and undistinguished are people too",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Most of the bigotry against gay people is bigotry against people who are different",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Is equality for people who are \"the same as you\" really equality",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "The point of a pride parade is that it is okay to be different",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "They're not meant to be kid-friendly",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "We have a society full of padded corners sanitized for your six year old's comfort that censors and distorts strong messages with whining that they are \"not friendly for kids",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Guess what",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "That's fine",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "It's fine for something to not be child friendly",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "It's fine for people to be different",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "It's fine for people to celebrate their differences",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "That's the message of a pride parade",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "\"It's okay to be who you are",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "\" If that message makes you uncomfortable, so be it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "electricmink",
            "reply_time": "7 years ago",
            "reply_delta_num": "15",
            "reply_votes": "9 points",
            "reply_contents": [
              {
                "content": "The first step to acceptance is visibility - when the mainstream can pretend you don't exist, it's far easier for them to ignore injustice aimed at you",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Even if these events bring negative attention, even if they are \"gross\" (they aren't), they serve the purpose of forcing society-at-large to recognize that there are in fact large numbers of gay people among them, while working to desensitize them to some of their squeamishness about homosexuality by being blatantly over the top expressing it",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Seriously, once you (as a hypothetically mild homophobe) see a couple of guys in slave harness dry-humping on a parade float surrounding by glitter-encrusted gladiators shooting whipped-cream at passersby from crotch level, seeing a gay couple quietly holding hands as they walk down the street becomes far less shocking and may even look positively hum-drum to you",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "1",
                "evidence": "1",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "ralph-j",
            "reply_time": "7 years ago",
            "reply_delta_num": "285",
            "reply_votes": "7 points",
            "reply_contents": [
              {
                "content": "I feel like the gay community should have a positive outreach celebration to show everyone how \"normal\" the average gay person is",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Who we love or have sex with is one of the main differentiating characteristics that we share as a community, so of course it's going to be used to distinguish a mere carnival from a pride parade",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "And apart from explicit imagery or acts in public, I think this is appropriate",
                "is_claim": "1",
                "claim_type": "evaluation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Human rights are not about becoming invisible or indistinguishable from the general population",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "We should strive for acceptance despite potential differences to \"normal\" people",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "1",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "hacksoncode",
            "reply_time": "7 years ago",
            "reply_delta_num": "393",
            "reply_votes": "3 points",
            "reply_contents": [
              {
                "content": "The key element of shame for gay people is that they have to hide their sexuality",
                "is_claim": "1",
                "claim_type": "interpretation",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "Are you really surprised that a celebration of their pride would involve not hiding their sexuality",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "You need not feel bad about eschewing taking your children to gay pride events for exactly the same reason that you'd eschew taking them to Mardi Gras",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "1",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "It's not for them",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "There's no reason why that should convey any kind of message about being gay/straight in either case",
                "is_claim": "0",
                "claim_type": "0",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          },
          {
            "replyer_name": "NeuroticIntrovert",
            "reply_time": "7 years ago",
            "reply_delta_num": "17",
            "reply_votes": "2 points",
            "reply_contents": [
              {
                "content": "It's not about pride",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              },
              {
                "content": "It's about anti-shame",
                "is_claim": "1",
                "claim_type": "disagreement",
                "logos": "0",
                "pathos": "0",
                "evidence": "0",
                "relevance": "0",
                "ethos": "0",
                "concreteness": "0",
                "eloquence": "0"
              }
            ]
          }
        ]
      }
    ]
  }
]