{
  "Eugenics-31": [
    {
      "op_claim": "I believe that just like we have licenses for driving there should be a license for having a child. CMV",
      "op_premise": "[\"Let's face it. Humanity is broadening the gap between them and the rest of the animal kingdom. We are on the top of the food chain and there are over 7 billion of us: reproduction is not about survival anymore. There are way too many of us for children to just be spouting out of their moms vaginas every 5 seconds.\", \"If we require licenses for things such as driving a vehicle or being a practicing doctor, why don't we require it for raising a human being?\", \"I don't believe reproduction/conception is a miracle. If anything, it's the phenomenon furthest away from a miracle: it happens every day in every part of the world, and can be done by every single living thing - AND we know how it all works. Birth is no miracle. Birth is the most common behavior amongst all living things.\", 'We live in a world where we put laws and regulations on every day life. So if a life of a human being is SO important, why are we just making them by the bucketful?', 'Many are unwanted. Many cannot be raised in the social-economic status they were born in. Many are mistreated, permanently scarred mentally and physically, or even die because certain people are just not fit to be good parents in the modern day world. So why are we letting new life be born into a world that will not be adequate for them?', \"If the government is going to put a restriction on what plants I can or cannot set on fire, or where and where not it's appropriate for me to open a beer, OR WHETHER IT'S LEGAL OR NOT TO WALK AS MOTHER NATURE PUT ME IN THIS PLANET AND BE NAKED, I think they have all the right to put a regulation on whether or not I'm fit to have a child that will grow with adequate resources and shelter, good education, morals, love, etc.\", 'If licenses were required, all children would be born in what would be an almost perfect scenario for them to grow healthy and have a successful future. Not only this, but licensing birth would also hav ea huge impact on third world countries. World poverty could become manageable. Diseases could be controlled. There would be no adoption centers. Every child would have a wonderful upbringing - which in turn means wonderful lives as adults.', 'In all honesty, I think if we ever want to make any solid advances as an \"intelligent species\", one of the first things we gotta change is that just because you can make a baby doesn\\'t mean you\\'re fit to be a parent.', 'EDIT: Consequences would be to terminate the life of the baby either during pregnancy (if detected during) or right at birth. Maybe the age cap would be 1 or 2 years old in the case of a hiding mother. This procedure could be law in hospitals. Poor countries where birth often occurs at home and not in hospitals: Well, that would be hard to work around with. But it can be done. Just look at the one-child policy in China.', \"EDIT 2: YES IT WILL BE UNCONSTITUTIONAL. YES IT WILL MOSTLY HAPPEN UNDER TOTALITARIAN GOVERNMENTS. I SEE NO PROBLEM IN THIS SINCE IT'S LOOKING OUT FOR NEW LIFE.\", \"EDIT 3: I really enjoy all the arguments that go for freedom of one's body or those that go against more government regulation. But I truly believe these are all in favor of the parents, not the child. I'm trying to picture a world in which every child grows in above average conditions (mentally and physically... not necessarily economically), but all I get back is people fighting for whatever mothers want. I don't think we should be focusing on what is better for the parents, but what is better for the new life.\", \"EDIT 4: I am learning a lot from you guys, but I've yet to be even slightly convinced otherwise. Thank you to those who quote sources and refute with hard-on facts. I didn't create this thread to be an asshole whose mind cannot be changed. I like to learn.\", 'EDIT 5: now opinions are starting to get like \"you\\'re sick and killing babies is WRAWNG.\" yes well would you tell me why you hold this view? it would be easier to reply to you and have a debate that way.', \"EDIT6: I try not to call this eugenics since I'm not choosing on basis of genetics. But rather mental health and availability to provide resources.\", \"also i'm a girl.\"]",
      "reply-info": [
        {
          "replyer_name": "Amarkov'",
          "reply_time": "7 years ago'",
          "reply_delta_num": "30",
          "reply_votes": "4 points'",
          "reply_contents": [
            {
              "content": "So if a life of a human being is SO important, why are we just making them by the bucketful",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "1",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.1993,
              "eloquence": 0,
              "elo_info": [
                0,
                "So if a life of a human being is SO important, why are we just making them by the bucketful",
                []
              ]
            },
            {
              "content": "We aren't",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "1",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": NaN,
              "eloquence": 0,
              "elo_info": [
                0,
                "We aren't",
                []
              ]
            },
            {
              "content": " In every developed country, birth rates are at or below the replacement rate",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "1",
              "pathos": "0",
              "evidence": "1",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2299,
              "eloquence": 0,
              "elo_info": [
                0,
                " In every developed country, birth rates are at or below the replacement rate",
                []
              ]
            },
            {
              "content": "And in any case, how would you enforce the regulations you want",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "1",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2056,
              "eloquence": 0,
              "elo_info": [
                0,
                "And in any case, how would you enforce the regulations you want",
                []
              ]
            },
            {
              "content": " What would happen to parents who had unlicensed children",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "1",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2249,
              "eloquence": 1,
              "elo_info": [
                1,
                " What would happen to parent who had unlicensed children",
                [
                  {
                    "category": "Grammar",
                    "contextoffset": 22,
                    "errorlength": 7,
                    "message": "The verb after \"to\" should be in the base form: 'parent'.",
                    "replacements": [
                      "parent"
                    ]
                  }
                ]
              ]
            },
            {
              "content": "2",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": NaN,
              "eloquence": 0,
              "elo_info": [
                0,
                "2",
                []
              ]
            }
          ]
        },
        {
          "replyer_name": "whiteraven4'",
          "reply_time": "7 years ago'",
          "reply_delta_num": "27",
          "reply_votes": "16 points'",
          "reply_contents": [
            {
              "content": "How would you enforce that, especially in third world countries",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "1",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2155,
              "eloquence": 0,
              "elo_info": [
                0,
                "How would you enforce that, especially in third world countries",
                []
              ]
            },
            {
              "content": " What would the consequences be for breaking it",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "1",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.1853,
              "eloquence": 0,
              "elo_info": [
                0,
                " What would the consequences be for breaking it",
                []
              ]
            }
          ]
        }
      ]
    }
  ]
}