{
  "Parenthood-75": [
    {
      "op_claim": "I think its ok to hit your children as a form of dicipline(within reason) ",
      "op_premise": "I'm talking a smack on the bum, hand or even cheek maybe. It would hurt, and stay for little bit then go away. Anything that left a permanent or even semi-lasting mark would be to much, but a fleeting stinging on the cheek I see no problem with.\", \"I don't think it should be sudden or for something little. it has to be something serious and come prior warning and explanation.\", \"I think pain can communicate the seriousness of doing something very wrong, to a child who doesn't understand that something is wrong yet and i think some children just don't respond to be being told off or having things taken away from them. Some will respond that way to being hit as well, but i think some would understand it more easily since its so tangible and is obviously a deterrent.\", \"I don't think its right for every child and situation. I don't think every parent should do it and i don't think it will always work, but i do think that in moderation it is sometimes an acceptable form of discipline.\", \"Ive had discussions with people about it and most say they just don't feel right doing it. I can see that and it is unpleasant, but any other kind of discipline will make the child feel bad as well, just in a different way. It still hurts them and i don't think the physical hurt of smack is so much more barbaric than say sending them to be alone in their room, if that's the thing they hate most.\", 'Edit: When i say discipline I mean after communication/conversation has failed. The child refuses to stop doing the wrong thing after being given a chance to explain themselves and having had the parents reasoning explained to them. Words are being ignored.', 'edit: Here is an example of how i would use it as a last resort sort of thing', 'If the kid stole a cookie, i would ask why and if the answer was good i would obviously let it slide.', 'If the answer was bad, eg\"because mums cooking sucks\" i would sternly tell them to put it back and explain to them why they cant have it and why what they did was wrong.', 'If they refused i would take it out of their hands and tell them to go to their room or something like that.', \"If they refused to go to their room i would warn them that if they don't go they'll get a smack.\", 'I would also talk to them about it afterward once everything had calmed down.",
      "reply-info": [
        {
          "replyer_name": "FaerieStories",
          "reply_time": "6 years ago",
          "reply_delta_num": "40",
          "reply_votes": "9 points",
          "reply_contents": [
            {
              "content": "It's the lazy option",
              "is_claim": "1",
              "claim_type": "evaluatioin",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2555,
              "eloquence": 0,
              "elo_info": [
                0,
                "It's the lazy option",
                []
              ]
            },
            {
              "content": "People should strive to actually bother to learn enough about their children that they are able to teach them without resorting to hitting them",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "1",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2181,
              "eloquence": 0,
              "elo_info": [
                0,
                "People should strive to actually bother to learn enough about their children that they are able to teach them without resorting to hitting them",
                []
              ]
            },
            {
              "content": "There's always a way to teach children, and if you can't find that way: hitting them is not an acceptable compromise",
              "is_claim": "1",
              "claim_type": "disagreement",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2185,
              "eloquence": 0,
              "elo_info": [
                0,
                "There's always a way to teach children, and if you can't find that way: hitting them is not an acceptable compromise",
                []
              ]
            },
            {
              "content": "It's a barbaric and ridiculous practice and that should be a relic of less enlightened times - along with every other form of corporal punishment (including the death penalty)",
              "is_claim": "1",
              "claim_type": "evaluatioin",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2363,
              "eloquence": 0,
              "elo_info": [
                0,
                "It's a barbaric and ridiculous practice and that should be a relic of less enlightened times - along with every other form of corporal punishment (including the death penalty)",
                []
              ]
            },
            {
              "content": "The sooner the human race grows up and learns to embrace reason and empathy towards people we wish to teach a lesson rather than senseless violence, the sooner we might live in a world without senseless violence in all other aspects of life",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "1",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2216,
              "eloquence": 0,
              "elo_info": [
                0,
                "The sooner the human race grows up and learns to embrace reason and empathy towards people we wish to teach a lesson rather than senseless violence, the sooner we might live in a world without senseless violence in all other aspects of life",
                []
              ]
            },
            {
              "content": "If you hit kids, you're merely teaching the next generation the idea that violence is an acceptable answer to problems",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "1",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2255,
              "eloquence": 0,
              "elo_info": [
                0,
                "If you hit kids, you're merely teaching the next generation the idea that violence is an acceptable answer to problems",
                []
              ]
            }
          ]
        }
      ]
    }
  ]
}