{
  "Pride-89": [
    {
      "op_claim": "I think the Pride Parade enforces stereotypes and is a hindrance on the Gay Rights movement. CMV",
      "op_premise": "I support gay marriage as much as the next Liberal Canadian, but I think that the Gay Pride Parade does more damage to the LGBTQ community than the community would like.', \"I think of it this way - people who don't accept homosexuals often believe that gay people are all overly eccentric individuals who prance around acting fabulous. There is a large group of men, often walking around wearing little to no clothing - often times intoxicated - and the event is highly publicized around the world.\", 'If someone was on the fence about supporting the gay community, would attending a pride parade really make them want to support the community? Everything people falsely believe about the gay community is seemingly proven true when people hear about the pride parade.', \"I understand the whole 'love who you are and we accept you' movement that the pride parade is promoting, but Jesus Christ people. I'm not against old men wearing thongs in public because they are gay, I'm against it because I just don't want to see it. As a heterosexual man, I get equally uncomfortable when an attractive woman walks around in a very revealing outfit in public.\", 'Please, change my view, and convince me that the pride parade does more good than it does harm.', \"Edit: I think a lot of you are assuming that I'm NOT against women wearing skimpy outfits for other parades. And again, I get equally as uncomfortable. It's just not something that should be shown in a public place in my opinion.\", \"I'm seeing a lot of pro-gay comments and that's fantastic, but please don't forget that I am also for the gay movement. I just think that the pride parade is inhibitating the social movement for worldwide legalization and acceptance.\", \"This is one of those topics that no matter how I word this i am going to seem like an asshole. So i'll just say : why would I want to watch a bunch of mostly naked men and women wander the streets dancing? I'm all for people embracing their sexuality, but I think that your sexuality should be something you keep close to you, whether you are gay or straight. I'm genuinely opposed to men oggling women to express their sexuality as well, so don't think it's just me being against gay expression.\", 'EDIT 2***: Alright alright you win THIS time Reddit. From some what I\\'ve read, the pride parade is accepting in the way that a lot of people can say \"If that hairy naked dude is comfortable with who he is, then I can be too!\" Which  although it sounds a bit ridiculous, I can see how it can have a positive impact in the community. Everyone can be accepted for who they are, and if I ever see someone being overly fabulous, I think in my head I\\'m just going to assume that this is a one-off thing that they do in order to make other members of the community comfortable in their own skin.', 'THAT BEING SAID - it still enforces ridiculous stereotypes that I loathe...but the positive impact of the parade seems to outweigh the negativity the community gets from the stereotypes.', \"TLDR; You have all, slowly convinced me that the Pride Parade can be a positive thing in people's lives because people can think 'If he's comfortable - then I can be too.' But you haven't convinced me that the pride parade DOESN'T push RIDICULOUS stereotypes into the average person's mind.\", \"Also, TIL a lot of people supporting the gay movement are really hateful towards people that don't support every aspect of the gay community.\", \"Oh. And I'm digging all the discussion in the comments. Even though a lot of it is one sided.",
      "reply-info": [
        {
          "replyer_name": "BenIncognito",
          "reply_time": "6 years ago",
          "reply_delta_num": "135",
          "reply_votes": "23 points",
          "reply_contents": [
            {
              "content": "If someone was on the fence about supporting the gay community, would attending a pride parade really make them want to support the community",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "1",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2203,
              "eloquence": 1,
              "elo_info": [
                1,
                "If someone was on the fence about supporting the gay community, would attend a pride parade really make them want to support the community",
                [
                  {
                    "category": "Grammar",
                    "contextoffset": 43,
                    "errorlength": 9,
                    "message": "The verb 'would' requires the base form of the verb: 'attend'",
                    "replacements": [
                      "attend"
                    ]
                  }
                ]
              ]
            },
            {
              "content": "Everything people falsely believe about the gay community is seemingly proven true when people hear about the pride parade",
              "is_claim": "1",
              "claim_type": "interpretation",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.228,
              "eloquence": 0,
              "elo_info": [
                0,
                "Everything people falsely believe about the gay community is seemingly proven true when people hear about the pride parade",
                []
              ]
            },
            {
              "content": "People who would only support homosexuals if they acted \"normal\" (like heterosexuals in their opinion) are jerks and, quite frankly, I don't care about them",
              "is_claim": "1",
              "claim_type": "evaluation",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.208,
              "eloquence": 2,
              "elo_info": [
                2,
                "People who would only support homosexuals if they acted “normal” (like heterosexuals in their opinion) are jerks and, quite frankly, I don't care about them",
                [
                  {
                    "category": "Miscellaneous",
                    "contextoffset": 43,
                    "errorlength": 1,
                    "message": "Use a smart opening quote here: '“'.",
                    "replacements": [
                      "“"
                    ]
                  },
                  {
                    "category": "Miscellaneous",
                    "contextoffset": 43,
                    "errorlength": 1,
                    "message": "Use a smart closing quote here: '”'.",
                    "replacements": [
                      "”"
                    ]
                  }
                ]
              ]
            },
            {
              "content": "Allies should be allies regardless of their perception of the gay community, because human rights transcend any issue one might have with harmless behavior",
              "is_claim": "1",
              "claim_type": "interpretation",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2547,
              "eloquence": 0,
              "elo_info": [
                0,
                "Allies should be allies regardless of their perception of the gay community, because human rights transcend any issue one might have with harmless behavior",
                []
              ]
            }
          ]
        },
        {
          "replyer_name": "veggiesama",
          "reply_time": "6 years ago",
          "reply_delta_num": "42",
          "reply_votes": "7 points",
          "reply_contents": [
            {
              "content": "overly eccentric individuals who prance around",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.3131,
              "eloquence": 1,
              "elo_info": [
                1,
                "Overly eccentric individuals who prance around",
                [
                  {
                    "category": "Capitalization",
                    "contextoffset": 0,
                    "errorlength": 6,
                    "message": "This sentence does not start with an uppercase letter",
                    "replacements": [
                      "Overly"
                    ]
                  }
                ]
              ]
            },
            {
              "content": "There is a large group of men, often walking around wearing little to no clothing - often times intoxicated - and the event is highly publicized around the world",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "1",
              "pathos": "0",
              "evidence": "1",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2028,
              "eloquence": 0,
              "elo_info": [
                0,
                "There is a large group of men, often walking around wearing little to no clothing - often times intoxicated - and the event is highly publicized around the world",
                []
              ]
            },
            {
              "content": "Except for the part about being \"fabulous,\" I'd say this describes a lot of the more outrageous sports fans",
              "is_claim": "1",
              "claim_type": "interpretation",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.1951,
              "eloquence": 2,
              "elo_info": [
                2,
                "Except for the part about being “fabulous,” I'd say this describes a lot of the more outrageous sports fans",
                [
                  {
                    "category": "Miscellaneous",
                    "contextoffset": 32,
                    "errorlength": 1,
                    "message": "Use a smart opening quote here: '“'.",
                    "replacements": [
                      "“"
                    ]
                  },
                  {
                    "category": "Miscellaneous",
                    "contextoffset": 43,
                    "errorlength": 1,
                    "message": "Use a smart closing quote here: '”'.",
                    "replacements": [
                      "”"
                    ]
                  }
                ]
              ]
            },
            {
              "content": "Plenty eccentric, plenty drunk, plenty publicized",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "1",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2305,
              "eloquence": 0,
              "elo_info": [
                0,
                "Plenty eccentric, plenty drunk, plenty publicized",
                []
              ]
            },
            {
              "content": "Does not affect the popular perception of sports whatsoever",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "1",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2677,
              "eloquence": 0,
              "elo_info": [
                0,
                "Does not affect the popular perception of sports whatsoever",
                []
              ]
            }
          ]
        }
      ]
    }
  ]
}