{
  "Suicide-94": [
    {
      "op_claim": "I think suicide is a good way out.",
      "op_premise": "I've had a reasonably good life. I had a nice upbringing with two loving parents, I have been very successful in my field, I've made plenty of friends and had lots of relationships (some fulfilling, some not).\", 'However as far back as I can recall I don\\'t think there\\'s been a time where I wouldn\\'t have taken the option to die and \"erase\" my time on earth.', \"I haven't because my parents (and a few others I am close enough with) are still alive and I don't want to cause them that much suffering. But when my parents pass on and I can otherwise sever ties sufficiently with the world, I think suicide will be my best option (the only shame is I can't convince everyone I know to share this view).\", 'I know life is rich and full of ups and downs. But to me riding the highs and lows seems pointless.', '\"Think of all the good times you don\\'t know you\\'ll have yet!\"..Living seems like some strange type of masturbation. Even if I were to commit some grand act to improve the state of humankind..this too seems meaningless because my view is one I believe is appropriate for all human beings. It seems that life itself is fairly meaningless and because of this I see no reason to go on living due to spurts of endorphins and an evolutionarily cultivated inability to \"pull the trigger.\"', \"This is not the most articulate post so feel free to ask for clarification if needed. But if you can, I'd love for you all to CMV.\", 'EDIT: To those who are replying to say that my care for my family and friends contradicts my position, this may be true. However, it does not seem to refute the essence of my argument. I can only say that I am human and that these things \"seem\" important to me (albeit unfoundedly). This doesn\\'t mean I don\\'t believe what I\\'m saying, just that at the moment I cannot go through with it (this is a pretty natural conflict of opinion to develop in a conscious creature which is fundamentally an animal in nature). There are also many replies regarding \"making meaning.\" To me (unless someone wants to expand and show me otherwise) this is a kind of vague platitude that doesn\\'t carry much weight.', 'However, a couple of comments have led to this modification/clarification: I suppose my view leads me to death rather than various types of activities some have listed (kids, fishing in Alaska, traveling the world, etc.) because fundamentally I have never been meaningfully happy enough to make it worthwhile. To me sarcasm24 got it right with \"being dead would be just as meaningless, but would also avoid all the toil that goes into a life that is, ultimately, meaningless.\" I recognize that this is a point where others might say I need medication or a new outlook or some change that might make me happy. But to me it seems like virtually all lives will end up falling into the category sarcasm24 is laying out.', 'EDIT 2: Wow, lots of great responses here. Thanks for a constructive dialogue! I have a lot of work to get done this morning but I intend to go through all the replies here more thoroughly this afternoon. I really appreciate all the responses and am excited to read through them :)', \"EDIT 3: Some closing thoughts on this thread..I suppose my argument makes little sense if you could be happy enough. Meaninglessness may still be a problem, but suicide is only a solution if being alive is in some way difficult or upsetting. That said, it's too easy to dismiss this as something that can be fixed through medication (if you're depressed), pursuing your dreams, having good friends and good hobbies, etc.. I am still left feeling that most people on planet earth will never attain a level of happiness that makes life the better option.\", \"Life is hard for almost everyone. And to me it's hard enough (again, for almost everyone) that suicide doesn't seem like an inherently poor choice. But this is very subjective. If you think you are having a good enough time, I hope you all continue to do so and continue to enjoy life!\", 'Personally, I think I will use the next couple years to pursue some of the suggestions of this thread (meditation, completely new activities, maybe a psychedelic, etc.). Hope that I can report back to this thread in a year or two and tell you that you all changed my view.",
      "reply-info": [
        {
          "replyer_name": "stevejavson",
          "reply_time": "7 years ago",
          "reply_delta_num": "12",
          "reply_votes": "132 points",
          "reply_contents": [
            {
              "content": "OP, if your entire argument is based on nihilism, then it makes no sense for you to put death as the preferable option to life since they are both fundamentally meaningless",
              "is_claim": "1",
              "claim_type": "disagreement",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2264,
              "eloquence": 0,
              "elo_info": [
                0,
                "OP, if your entire argument is based on nihilism, then it makes no sense for you to put death as the preferable option to life since they are both fundamentally meaningless",
                []
              ]
            },
            {
              "content": "There is no reason to value one over the other",
              "is_claim": "1",
              "claim_type": "disagreement",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.197,
              "eloquence": 0,
              "elo_info": [
                0,
                "There is no reason to value one over the other",
                []
              ]
            }
          ]
        },
        {
          "replyer_name": "Gehalgod",
          "reply_time": "7 years ago",
          "reply_delta_num": "16",
          "reply_votes": "5 points",
          "reply_contents": [
            {
              "content": "Living seems like some strange type of masturbation",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2574,
              "eloquence": 0,
              "elo_info": [
                0,
                "Living seems like some strange type of masturbation",
                []
              ]
            },
            {
              "content": "Um, what",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.1542,
              "eloquence": 0,
              "elo_info": [
                0,
                "Um, what",
                []
              ]
            },
            {
              "content": "Can you elaborate a bit more on this",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.2169,
              "eloquence": 0,
              "elo_info": [
                0,
                "Can you elaborate a bit more on this",
                []
              ]
            },
            {
              "content": "I don't think I understand the comparison you're trying to make here",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.1872,
              "eloquence": 0,
              "elo_info": [
                0,
                "I don't think I understand the comparison you're trying to make here",
                []
              ]
            }
          ]
        },
        {
          "replyer_name": "whiteraven4",
          "reply_time": "7 years ago",
          "reply_delta_num": "27",
          "reply_votes": "1 point",
          "reply_contents": [
            {
              "content": "I'm assuming you never plan to have kids",
              "is_claim": "0",
              "claim_type": "0",
              "logos": "0",
              "pathos": "0",
              "evidence": "0",
              "relevance": "0",
              "ethos": "0",
              "concreteness": 0.1849,
              "eloquence": 0,
              "elo_info": [
                0,
                "I'm assuming you never plan to have kids",
                []
              ]
            }
          ]
        }
      ]
    }
  ]
}